#+TITLE: A primer on web services
#+INCLUDE: ./beamer_modern.org

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

** Modules

  - npm init

  - lodash (functional-like utilities).

  - mappa su array di numeri

#+begin_src js
var _ = require('lodash');
var r = [1,2,3]

_.map(_.filter(r, function(v) {
    return v<3;
}), function(i) {
    console.log(i);
})
#+end_src

#+RESULTS:
: 1
: 2

** Advanced / Closures


#+begin_src js 
  var genF = function(nome) {
      return function() {
          console.log("Ciao " + nome);
      }
  }

  setTimeout(genF("Vittorio"), 1000)
#+end_src

#+RESULTS:
: Ciao Vittorio

** Leggi e filtra file di oggetti


#+begin_src js 
var _ = require('lodash');
var fs = require('fs');

fs.readFile('./data.json', 'utf8', function(err, data) {
    if(err) {
        console.log('sorry, error');
    } else {
        var d = JSON.parse(data);
        _.forEach(_.filter(d, function(it) {
           return it.age < 26
        }), function(it) {
            console.log(it.lastName);
        })
    }
})
#+end_src

#+RESULTS:
: Flinn
: Young
: Milligan

